# Реализовать арифметическую функцию, работающую с векторами длины n

def main(z, x):
    s = 0
    n = len(z)

    for i in range(1, n + 1):
        s += (6 * x[n - i] ** 2 + 6 * z[i - 1] ** 3) ** 7

    return s


print(main([-0.18, 0.4, 0.31, -0.74, 0.51, 0.36, 0.27, 0.93],
           [0.81, -0.43, 0.0, -0.21, 0.92, -0.63, 0.44, -0.91]))
