# Найдите в документации встроенную (builtin) арифметическую функцию,
# которая возвращает не одно, а два значения разом.

print(divmod(5, 3))
